[
    {
        "filename": "25-5334 City of Hamilton Roster M&E - PROPOSAL",
        "chunks": [
            "Intro [25-5334 City of Hamilton Roster M&E - PROPOSAL]\nCITY OF HAMILTON REQUEST FOR ROSTER CANDIDATES - CATEGORY 30B - MECHANICAL & ELECTRICAL SERVICES\nPROVIDED TO:\tCITY OF HAMILTON\nPROVIDED BY:\tSMITH + ANDERSEN (LONDON)\nCONTACT:\tSTEPHEN MCDERMID, P.ENG., LEED GREEN ASSOCIATE | PRINCIPAL\nSTEPHEN.MCDERMID@SMITHANDANDERSEN.COM // 905-919-0591\nDATE:\tMARCH 27, 2025\nCONTENTS\nPG #1\tTable 5 - Statt Competency and Experience\nPG #18\tTable 6 - Company Competency and Experience\nPG #26\tTeam Resumes\nPG #43\tClimate Change\nPG #46\tValue Added",
            "Stephen A. McDermid\nB.A.Sc., P.Eng., LEED® Green Associate\nPrincipal\nStephen’s inherently collaborative, forward-thinking nature means he is always ready to explore new ways of designing for future flexibility and economic utility costs. His multi- discipline approach includes important considerations such as how design impacts the overall building structure, and how to look out for his clients’ best interests throughout their long-term investments in construction projects. A respected mechanical engineering leader, Stephen has provided expertise for projects both internationally and across Canada.\nHe believes the best way to design is with the future in mind, and instills this foundation as one of the leaders of our London office, where he provides invaluable mentorship and guidance to colleagues.\nRELEVANT EXPERIENCE\nCIVIC\n+ StarTech Community Centre and YMCA Partnership, London ON // P\n+ Nelson Pool Redevelopment, Burlington ON // P\n+ Byron Pool and Hath House, London ON // P\n+ Stoney Creek YMCA addition, London ON // P\n+ Clearwater Arena building assessment & feasibility study, Sarnia ON // P\n+ Tillsonburg Community Centre addition, ON // P\n+ South Gate Centre addition & renovation, Woodstock ON // P\n+ Memorial Park Pool, Welland ON // P\n+ Atlas Tube Recreation Centre, Lakeshore ON // PM\n+ Burlington Public Library – Central Branch, ON // PM\nEDUCATION\n+ Conestoga’s Skilled Trades Campus, Cambridge, ON // P\n+ University of Windsor, ON // P\nWindsor Armouries – School of Creative Arts\nWinsdor Star building (downtown campus)\nToldo Lancer Centre addition\nTunnel Bar-B-Q Building (Faculty of Arts campus)\nScience and Research Innovation Facility compliance\nE.D. Lumley Centre for Engineering Innovation\n+ Western University, London ON // P\nSynthetic laboratory renovation\nIvey Business School\nMRI chiller replacements\n+ Fanshawe College, London ON // P\nInnovation Village\nCentre for Applied Research and Innovation in Biotechnology Laboratory\nDowntown Campus Building B\n+ University of Toronto Scarborough (UTSC) Campus, ON // P\nClean room\nInstructional Centre Complex\nChemistry & biology hood upgrades\nVivarium renovation & upgrade\n+ University of Waterloo, ON // PM\nEngineering 5\nEngineering 7\nCampus sub-metering\nNew student residence\n+ York University Accolade Project, Toronto ON // D",
            "Raed El-Khatib\nB.A.Sc., P.Eng., LEED® Green Associate\nPrincipal\nRaed is a skilled professional with over a decade of industry experience. He knows first- hand the impact that in-depth analysis and a collaborative approach can have when creating integrated and well-utilized spaces. His commendable leadership and project management skills have allowed Raed to take on a variety of projects – from new base buildings and recreational facilities that are technical and coordination-intensive in nature, to tenant fit-outs with quick turnaround times and campus energy and equipment studies. Raed’s proactive work ethic supports clients in making informed decisions and building strong relationships to facilitate successful and well-managed projects.\nRELEVANT EXPERIENCE\nCIVIC\n+ City of London Municipal Office Renovation, ON // PM\n+ Cambridge Recreational Centre, ON // PM\n+ Bryanston Community Cntre Rennovation, ON // PM\n+ London Courthouse Security Upgrades, London, ON // PM\n+ City of London municipal office, London, ON // PM\n+ Mainway Recreation Centre study, Burlington ON // PM\n+ University of Windsor Toldo Lancer Centre, ON // PM\n+ Bryanston Community Centre renovation, London ON // D\nEDUCATION\n+ Western University, Biotron Building Growth Chambers Updgrades, London, ON // P\n+ Western University, Starbucks Renovation at UCC, London, ON // P\n+ Western University, Argo’s Tea at Weldon, London, ON // A\n+ University of Windsor (UWindsor) School of Creative Arts, ON // PM\n+ UWindsor Armouries Building, ON // PM\n+ Fanshawe College Advanced Research Biotech Lab renovation, London ON // PM\n+ Fanshawe College School of Culinary Arts,\nLondon ON // PM\n+ University of Western Ontario (UWO) Richard Ivey School of Business lower level interior fit-out, London ON // PM\n+ McMaster University Biointerface renovation, London ON // PM\n+ University of McMaster- Wilson Hall social science 1st and 2nd floor renovation, London ON // PM\n+ University of Waterloo Engineering 7 Building, ON // PM\n+ Fanshawe College Central ‘D’ Campus plant valve optimization, London ON // PM\n+ University of Waterloo Earth Science Building study, ON // PM\n+ University of Waterloo Innovation Arena, Kitchener ON // PM\n+ Fanshawe College Innovation Village Phases 1, 2 & 3, London ON // PM\n+ UWindsor Ron W. Ianni Faulty of Law building renovation, ON // PM\n+ UWindsor Medical Building renovation ON // D\n+ Niagara College Advanced Manufacturing\nInnovation Centre addition, Welland ON // D",
            "Brad Tilson\nB.Sc., P.Eng., LEED® AP\nPrincipal\nThroughout his career, Brad has focused on enhancing the lines of communication for every project team he is part of. As an experienced Principal-in-Charge on all types of projects, Brad believes in treating the client, consultant group, and contractors as a single team.\nThis leadership approach consistently results in improved trust between team members and delivers clients exceptional projects completed on time and on budget. Brad has engineered complex projects across a number of sectors, including multi-unit residential, post-secondary institutions, commercial, healthcare, and industrial. With a portfolio that includes award-winning post-secondary and certified net zero and LEED projects, Brad is a valuable asset to any project team.\nRELEVANT EXPERIENCE\nCIVIC\n+ City of London Office Relocation - Citi Plaza, ON\n// P\n+ Halton Provincial Offences Office, Milton ON // P\n+ Halifax Regional Municipal Planning and Development Department Renovation, ON // P\n+ London Courthouse security upgrade, ON // P\n+ John Sopinka Courthouse security upgrade, Hamilton ON // P\n+ United Family Courthouse security upgrade, Hamilton ON // P\n+ Elgin Middlesex Detention Centre medical & canine trailers, London ON // P\n+ Wiarton OPP Detachment generator upgrades, ON // P\n+ Cayuga OPP Detachment generator upgrades, ON // P\n+ Halifax Regional Municipality Parking Enforcement Office, NS // P\n+ City of London Municipal Office, ON // P\n+ Stone Road Complex electrical distribution study, Guelph ON // PM\n+ East London Social Services Office, ON // PM\n+ Burlington / Halton Hills Courthouse, ON // PM\n+ Child and Parent Resource Institute fire alarm upgrade, London ON // PM\n+ Elgin Middlesex Detention Centre fire alarm upgrade, London ON // PM\n+ Sarnia Courthouse courtroom & office renovation, ON // PM\n+ London Courthouse generator upgrade feasibility study, ON // PM\n+ Ministry of Transportation Ontario office building fire alarm & lighting controls upgrade, London ON // PM\n+ Provincial Courthouse and Registry Office lighting controls upgrade, Kitchener ON // D\n+ Floradale Fire Hall, ON // P\n+ London Fire Station 6 addition, ON // P\n+ Ontario Provincial Police (OPP) Communications Centre, London ON // P\n+ Southwestern Ontario OPP generator feasibility studies, ON // P\n+ Royal Canadian Mounted Police (RCMP) Windsor Detachment fire alarm upgrade, ON // PM\n+ Teviotdale OPP Detachment ON // PM\n+  Fergus OPP Detachment, ON\n// PM",
            "Peter Lostracco\nP.Eng., LEED Green Associate\nAssociate\nPeter leads with confidence, communicating across multiple disciplines and motivating his team to achieve both project objectives and their fullest potential. He began with\nSmith + Andersen as a co-op before graduating from the University of Waterloo with a degree in mechanical engineering. Peter has proven himself to be a strong coordinator who is knowledgeable in multiple aspects of mechanical systems. Detailed-oriented by nature, Peter’s expertise includes the overall design of HVAC, plumbing and drainage, and life safety systems, as well as large-scale design-build projects. His role can include anything from design, to project management, to construction administration, and his accelerated career path is a testament to his versatile capabilities. His project background, in combination with the strategic way he approaches every design, means optimal end results for clients making him a critical asset to any team.\nRELEVANT EXPERIENCE\nCIVIC\n+ Macdonald Block Reconstruction design- build, Toronto ON // PM\nSPORTS & RECREATION\n+ Avenir Centre\nmulti-use sports and entertainment centre design-build, NB // D, PM\n+ Mosaic Stadium design- build, Regina SK // D\n+ Pan Am Aquatics Centre design-build, Toronto ON\n// JD\nEDUCATION\n+ Seneca College King Campus design-build, King City ON // D, PM\n+ University of Toronto Faculty of Law addition, ON // JD\nHOSPITALITY\n+ Seneca College Magna Hall Starbucks tenant fit-up, King City ON // PM\nOFFICE\n+ Canon Headquarters, Brampton ON // JD\nRETAIL\n+ Manulife Centre Redevelopment renovation and tenant fit-up,\nToronto ON // D, PM",
            "Mohamed Elsherif\nP.Eng., LEED® Green Associate\nAssociate\nWith a goal-oriented approach and a reputation as a highly-effective communicator, Mohamed is an asset to every project team. Mohamed brings nearly two decades of experience to the table – an industry leader who possesses the technical skills to produce effective and efficient results.As a member of the U.S. Green Building Council (USGBC), Mohamed is committed to sustainable design practices. Having worked on projects of various sizes, across a variety of market sectors, Mohamed precisely coordinates the details of each design solution with other disciplines. Through his mechanical background, he specializes in leading teams to design HVAC, plumbing, and fire protection systems. Some of his more notable projects include the Cardiovascular Research Building Institute in Hamilton, the Four Seasons Tower in Baltimore, and more recently, the Waterloo Regional Airport Hold Room and Domestic Baggage Addition in Waterloo. Mohamed possesses a clear picture of the end goal and continuously steers projects toward success with ease.\nRELEVANT EXPERIENCE\nCIVIC\n+ Waterloo International Airport Expansion, ON // PM\n+ Tillsonburg Recreation Centre Renovation, Upgrades and Addition, ON\n// PM\n+ South Gate Centre Addition and Renovation, Woodstock ON // PM\n+ Consolidated Courthouse, Thunder Bay ON // HE\n+ Bruce Power Fire Training Facility, Tiverton ON // HP\nHEALTHCARE\n+ Cardiovascular Research Institute Building (Hamilton Health Science research labs building), ON // HE\n+ Humane Society Stratford animal care facility, ON // HP\n+ Greenseal Medical Marijuana Production, Stratford ON // HE\n+ 746 Baseline Road Phase 2 surgical room renovations, London ON // PM\n+ Queensway Carelton Hospital, Nepean ON // PM\nARTS, CULTURE + ENTERTAINMENT\n+ London Starlight Casino, ON // HP/PM\nEDUCATION\n+ Amherstburg High School, ON // PM\nHOSPITALITY\n+ Four Seasons Tower high-rise complex (hotel, residential and commercial building),\nBaltimore Maryland // HE\nINDUSTRIAL\n+ Darlington Computer Maintenance Facility OPG repair shops and offices, ON // HE\n+ CANDU New Zone 3 Lab contaminated tools cleaning lab with Zone3 hazard level building, Mississauga ON // HE\nOFFICE\n+ Google KW Main Office (51 Breightaupt St. Block) renovation of factory into\ncommercial office, Kitchener ON // HP\nPUBLIC SPACES\n+ Hellenic Community Centre, London ON // HP",
            "Brandon Power\nB.E.Sc., P.Eng., LEED® Green Associate\nProject Manager\nBrandon is a team-oriented designer, a skill he uses while motivating and coordinating with all project stakeholders. This has served him well in past project experiences while applying his extensive knowledge of ventilation systems, boiler plants, and variable refrigerant systems. Brandon takes an analytical approach in his designs to find solutions that best meet client goals. His commitment to prioritizing client needs extends to his strong time management skills while meeting project deadlines.\nRELEVANT EXPERIENCE\nCIVIC\n+ Wasaga Twin Pad and Library, ON // D\n+ Middlesex County Primary Operations Centre addition, London ON // D\nRESIDENTIAL\n+ Terrace Lodge long term care home, Aylmer ON // D\n+ Sifton Spektra, London ON // D\n+ Sterling Square Apartments, Brantford ON // D\nARTS, CULTURE + ENTERTAINMENT\n+ Wasaga Beach Casino, ON // D\nCOMMERCE\n+ Masonville Place renovations, London ON // D\nEDUCATION\n+ University of Waterloo Autonomous Vehicle Research and Intelligence Lab, ON // D\n+ Elementary School Les Rapides cooling system and ventilation upgrades, Sarnia ON // D\n+ St. Andre French Immersion Catholic School cooling system and control updates, Windsor ON // D\n+ Queen Victoria Public School washroom upgrades, Windsor ON // D\nLABORATORIES\nPUBLIC SPACES\n+ Wasaga Twin-pad Arena and Library, Wasaga Beach ON // D\nParas Wadhwa\nB.Tech., M.Eng.\nSenior Designer\nParas’ flexible approach to design allows him to adapt to complex problems, and provide innovative solutions. Paras brings project experience spanning numerous sectors\nand continents to the table. As a team player, Paras believes that communication and collaboration are essential to achieving project goals. He takes pride in being a fast-learner and is eager to apply his technical skills to new projects.\n+ Norfolk County Arenas Expansion - Delhi, Port Dover, Waterford and Langton, ON // D\n+ Middlesex County Governance and Administration Centre Building, ON // D\n+ New Zealand Pavilion HVAC design, Dubai UAE // D\nHEALTHCARE\n+ Oman Hospital\nHVAC design, Suwaiq // D\n+ Oman Hospital HVAC design, Khasab // D\n+ Oman Hospital HVAC design, Salalah // D\nHOSPITALITY\n+ Red Sea Hotel HVAC design, Saudi Arabia // D\n+ Al Dar Noya Villas HVAC design,\nAbu Dhabi UAE // D\nTRANSPORTATION\n+ University Station HVAC design, Birmingham UK // D",
            "Paras Wadhwa\nB.Tech., M.Eng.\nSenior Designer\nParas’ flexible approach to design allows him to adapt to complex problems, and provide innovative solutions. Paras brings project experience spanning numerous sectors\nand continents to the table. As a team player, Paras believes that communication and collaboration are essential to achieving project goals. He takes pride in being a fast-learner and is eager to apply his technical skills to new projects.\nRELEVANT EXPERIENCE\nCIVIC\n+ Norfolk County Arenas Expansion - Delhi, Port Dover, Waterford and Langton, ON // D\n+ Middlesex County Governance and Administration Centre Building, ON // D\nARTS, CULTURE + ENTERTAINMENT\n+ New Zealand Pavilion HVAC design, Dubai UAE // D\nHEALTHCARE\n+ Oman Hospital\nHVAC design, Suwaiq // D\n+ Oman Hospital HVAC design, Khasab // D\n+ Oman Hospital HVAC design, Salalah // D\nHOSPITALITY\n+ Red Sea Hotel HVAC design, Saudi Arabia // D\nRESIDENTIAL\n+ Al Dar Noya Villas HVAC design,\nAbu Dhabi UAE // D\nTRANSPORTATION\n+ University Station HVAC design, Birmingham UK // D\nNey Olotu\nB.Eng., M.Eng., PMP\nProject Manager\nNey is a team player known for his commitment to collaboration and clear communication. His meticulous and detail-oriented approach has led to innovative and efficient mechanical designs for a variety of spaces, including civic facilities, laboratories, and multi-unit residential builds. Ney leverages his technical expertise and project management skills to build and maintain strong relationships that support overall project success and deliver client satisfaction.\n+ Public Services and Procurement Canada fit-up, Ottawa ON // D\n+ Place du Portage III Renewal Project tenant fit-up,\nOttawa ON // D\n+ Mapping and Charting Establishment - Canadian Armed Forces tenant fit-up, Ottawa ON // D\n+ Land Command Support System - Canadian Armed Forces tenant fit-up, Ottawa ON // D\n+ Canadian Forces Publication Depot tenant fit-up,\n+ Primacare Living Solutions long-term care home variable refrigerant flow (VRF) system installation, St. Catherines ON // PM\n+ Primacare Living Solutions long-term care home VRF system installation, Brampton ON // PM\n+ Sienna Senior Living long- term care home VRF system installation, Vaughan ON // PM\nINDUSTRIAL\n+ Hydrogenics Corporation clean room & wet lab HVAC installation, Mississauga ON // PM\n+ Sonoco Packaging manufacturing plant expansion,\nMississauga ON // PM\n+ Earth Fresh Foods cold room upgrade, Burlington ON // PM\nLABORATORY\n+ Contract Pharmaceutical ventilation system installation,\n+ Element Life Sciences Laboratory Relocation Project,\n+ Element Life Sciences Fire Testing Laboratory\ndesign & installation, Mississauga ON // PM\n+ University of Ottawa Indigenous Intellectual and Well-Being Research Lab renovation, ON //D\n+ 150 Wissler Road Multi-Unit Residential Development, Waterloo ON // PM\n+ Core Lofts condominiums boiler retrofit,\nHamilton ON // PM\n+ Core Lofts condominiums cooling tower filtration system, Hamilton ON // PM\n+ The Normand apartment Davis Food Court, ON // PM\n+ Lépine Lodge apartment building, Renfrew ON // D",
            "Mohammad  Al-Anee\nM.Eng., P.Eng., LEED® Green Associate\nSenior Project Manager\nA valued member of the Smith + Andersen London team, Mohammad is a seasoned professional with a decade of industry experience. Throughout his career, Mohammed has been a key player on challenging projects, specializing in residential, office renovations, and commercial developments. Mohammad leads by example, demonstrating both technical acumen and laudable leadership skills. From code acknowledgment to client management, Mohammad goes the extra mile to meet project goals and aim for complete client satisfaction.\nRELEVANT EXPERIENCE\nCIVIC\n+ John Sopinka Courthouse Security System Upgrades, Hamilton ON // PM\n+ Mountside Pool Revitalization, Burlington ON // PM\nRESIDENTIAL\n+ Terrace Lodge Long- Term Care Addition and Renovation, Elgin County ON // PM\n+ Vogue Residence, Waterloo ON // D/PM\n+ BB1 Building West 5, London ON // D/PM\n+ JSC Cottage design of a high-end cottage, Grandbend ON // D/PM\n+ City Centre, Kitchener ON // D\n+\nCOMMERCE\n+ Yonge-Sheppard Centre renovation, North York ON // D\n+ RBC renovation of 19th floor, Toronto ON // PM\n+ RBC renovation of two floors, Toronto ON // D/PM\n+ Dealer FX renovation of two floors, Markham ON // D/PM\n+ Capital One renovation of four floors,\nToronto ON // D/PM\nEDUCATION\n+ University of Waterloo, Innovation arena // PM\n+ Wilfrid Laurier University AIRD Builidng Addition // PM\n+ University of Western Ontario Richard Ivey School of Business renovation of lower level, London ON // D/PM\n+ Prince Andrew Public School, LaSalle ON // D/PM\nHEALTHCARE\n+ Terrace Lodge Long Term Care,\nElgin County ON // D/PM\n+ LHSC Surgical Suite renovation of clinic to a surgical suite, London ON // D\nINDUSTRIAL\n+ Hyundai renovation of service area,\nVaughan ON // D/PM\n+ U-Haul Storage, London ON // PM\n+ Synaptive renovation, Toronto ON // D\nOFFICE\n+ MD Financial renovation of multiple offices, ON // D/PM\n+ Digital Extreme renovation, London ON // D/PM\n+ Middlesex London Health Care Unit, ON // D/PM\nJademond Acielo\nB.Sc.\nDesigner\nJademond is a skilled professional with expertise in power distribution, load calculation, and lighting design, utilizing tools like Revit, AutoCAD, and Visual Lighting/AGI 32.\nSpecializing in MURB, education, and office buildings, Jademond excels in design software, problem-solving, and time management. Their favorite aspect of projects is navigating construction development and administration, ensuring smooth project execution and ongoing learning.\n+ Connestoga College Doon Campus, Renovation of 4th floor for new classroom and studio, Kitchener,ON //D\n+ Nokom’s House - University of Guelph, Guelph, ON //D\n+ CUPE Kitchener, Kitchener, ON //D\n+ WSIB Tartan Head Office, renovation of office buidling, London, ON //D\n+ 195 Dufferin renovation of office builidng to new\naffordable housing, London, ON //D\n+ Dietz Ave, Kitchener, ON //D",
            "Jademond Acielo\nB.Sc.\nDesigner\nJademond is a skilled professional with expertise in power distribution, load calculation, and lighting design, utilizing tools like Revit, AutoCAD, and Visual Lighting/AGI 32.\nSpecializing in MURB, education, and office buildings, Jademond excels in design software, problem-solving, and time management. Their favorite aspect of projects is navigating construction development and administration, ensuring smooth project execution and ongoing learning.\nRELEVANT EXPERIENCE\nEDUCATION\n+ Connestoga College Doon Campus, Renovation of 4th floor for new classroom and studio, Kitchener,ON //D\n+ Nokom’s House - University of Guelph, Guelph, ON //D\nOFFICE\n+ CUPE Kitchener, Kitchener, ON //D\n+ WSIB Tartan Head Office, renovation of office buidling, London, ON //D\nRESIDENTIAL\n+ 195 Dufferin renovation of office builidng to new\naffordable housing, London, ON //D\n+ Dietz Ave, Kitchener, ON //D\nKristoff Sahadeo\nB.A.Sc., LEED® Green Associate\nKristoff completed three co-ops in the industry while still in school, giving him exposure to a wide variety of mechanical systems. Now as a designer at S+A, he is continually\nexpanding on this experience, especially in plumbing, air-duct design, ventilation, and load calculations. Kristoff’s strong work ethic is complemented by an organized and methodical approach. This allows him to prioritize tasks, yet also adapt to changes and challenges during a project, in order to meet deadlines. Kristoff is always looking for ways to improve project components, whether from his own past mechanical system designs or through collaboration with the project team, to find the best solution for each project.\nCIVIC\n+ Stoney Creek YMCA Expansion, ON // D\n+ Guelph YMCA Renovation, ON // D\n+ Wasaga Beach Library and Twin-Pad Arena load\ncalculations and plumbing design, Wasaga ON // D\nCOMMERCE\n+ CF Fairview Park tenant fit-out, demolition plans\nand fire prevention and duct design, Kitchener ON // D\n+ 285 King St load and ventilation calculations, London ON // D\n+ St. André French Immersion Catholic Elementary\nSchool air duct design, Tecumseh ON // D\nHOSPITALITY\n+ Gnosh Dining and Cocktails at West 5 load calculations, London ON // D\n+ Residential\n+ 700 King St East Tower load calculations, London ON // D\n+ West 5 tenant fit-outs and system design, London ON // D\n+ Helio Apartments load calculations, London ON // D\nTRANSPORTATION\n+ Region of Waterloo International Airport plumbing design\nand washroom renovation, ON // D",
            "Emma Hoover\nDesigner\nEmma is a Mechanical Designer at Smith and Andersen, specializing in residential and high-rise projects. She holds a B.Eng in Mechanical Engineering from the University of Guelph (2023). Known for her detail-oriented approach, collaborative mindset, and problem-solving skills, Emma excels in the early stages of projects, particularly in\nbrainstorming, defining objectives, and strategic planning. She is passionate about setting projects up for success from the ground up.\nRELEVANT EXPERIENCE\nRESIDENTIAL\n+ 101 Spadina, High Rise Residential Condo, condo redevelopment, Toronto ON\n// D\n+ 100 Broadway Ave, High Rise Residential Condo, condo redevelopment, Toronto ON // D\n+ 110-120 Broadway Ave, High Rise Residential Condo, Toronto ON // D\n+ 117-127 Broadway Ave, High Rise Residential Condo, condo redevelopment, Toronto ON // D\n+ 589 Eglinton Ave E, High Rise Residential Condo, condo redevelopment, Toronto ON // D\n+ 1958 Duluth Cres, Low Rise Residential, affordable housing project, London ON // D\n+ 63 Charles St, Low Rise Residential, affordable housing project, Kitchener ON // D\nARTS, CULTURE + ENTERTAINMENT\n+ 449 Dundas St, Art Gallery, Art Gallery renovation, Woodstock ON // D",
            "Alina Morales Neyra\nE.I.T., B.Eng.\nSenior Designer\nAlina is a Senior Designer at S+A with a degree in Electrical Engineering & Society from McMaster University. Since joining the firm in 2019, she has progressed from Junior Designer to Senior Designer, specializing in lighting & power design, project management, and utilizing tools like BIM and dRofus. Alina is best known for her attention to detail, strong leadership, and expertise in Mental Health, Healthcare, and P3 projects. She is dedicated to creating impactful, innovative designs that prioritize user well-being and functionality.\nRELEVANT EXPERIENCE\nCIVIC\n+ Macdonald Block Reconstruction Project DBFM, Toronto ON // JD\nSPORTS + RECREATION\n+ Bracebridge Community Centre, Bracebridge ON // JD\n+ Orillia Recreation Centre, ON // JD\nHEALTHCARE\n+ Hillsborough Hospital Mental Health & Addictions Redevelopment Project, Acute Care Facility and Life Skills Centre, Charlotte PE\n// SD\n+ Hillsborough Hospital Mental Health & Addictions Redevelopment Project, Wellness and Transition Centre, Charlotte PE // SD\n+ Trillium Health Partners Peter Gilgan Mississauga Hospital, Mississauga ON// SD\n+ Niagara Health - St Catherines Hospital, LINAC Bunker Renovation, St Catherines ON// SD\n+ Niagara Health - Welland Hospital, Mechanical Upgrades, Welland ON// SD\n+ Lakeridge Health - Ajax/ Pickering Hospital, Decarbonization, Ajax ON// SD\n+ Centre for Addiction and Mental Health (CAMH) Phase 1D pursuit, Toronto ON // D\n+ New Adult Mental Health and Addictions Facility, St. John’s NL // D\n+ Centre for Addiction and Mental Health (CAMH) Phase 1C Redevelopment DBFM, Toronto ON // JD\nRESIDENTIAL\n+ M City 3 Condominiums, Mississauga ON // JD\n+ 185 Enfield Place Rental Towers, Mississauga ON // JD\n+ King Blue Condominiums and Hotel, Toronto ON // JD\n+ Minto Yorkville Park (94 Cumberland), Toronto ON\n// JD\n+ 300 Bloor St West, Toronto ON // JD\nCOMMERCE\n+ Sayers Foods Grocery Store, Apsley ON // D\nGeerththanna A\nLEED®\nDesigner\nGeerththana is an experienced electrical designer specializing in residential and commercial buildings. She is skilled in lighting design software such as Visual Lighting and Dialux, as well as AutoCAD and Revit. With a strong attention to detail and a passion for design coordination, she excels in identifying potential issues and developing effective solutions. Her focus on sustainable design is reflected in her LEED Green Associate certification.\nEDUCATION\n+ Conestoga Guelph Campus demolish existing building and reconstruction, Guelph, ON // D\n+ London Health Science Centre Surgical Suite , phase 2 renovations, London, ON\n// D\n+ London Health Science Centre VH Mobile MRI Trailer, London, ON // D\nOFFICE\n+ Middlesex EMS Building, London, ON // D\nPUBLIC SPACES\n+ Brant Library, County of Brant, ON // D\n+ 88 Queen Residential building, Kitchener, ON // D\n+ Barrie YMCA, Barrie, ON // D",
            "Geerththanna A\nLEED®\nDesigner\nGeerththana is an experienced electrical designer specializing in residential and commercial buildings. She is skilled in lighting design software such as Visual Lighting and Dialux, as well as AutoCAD and Revit. With a strong attention to detail and a passion for design coordination, she excels in identifying potential issues and developing effective solutions. Her focus on sustainable design is reflected in her LEED Green Associate certification.\nRELEVANT EXPERIENCE\nEDUCATION\n+ Conestoga Guelph Campus demolish existing building and reconstruction, Guelph, ON // D\nHEALTHCARE\n+ London Health Science Centre Surgical Suite , phase 2 renovations, London, ON\n// D\n+ London Health Science Centre VH Mobile MRI Trailer, London, ON // D\nOFFICE\n+ Middlesex EMS Building, London, ON // D\nPUBLIC SPACES\n+ Brant Library, County of Brant, ON // D\nRESIDENTIAL\n+ 88 Queen Residential building, Kitchener, ON // D\nSPORTS + RECREATION\n+ Barrie YMCA, Barrie, ON // D\nCameron Carpenter\nCameron Carpenter is a skilled CAD/BIM Technician and Designer with expertise in Architectural Technology. Specializing in Multi-Unit Residential projects, he is proficient in Variable Refrigerant Flow (VRF) Systems and Building Information Modeling (BIM).\nCameron excels at creating clear, concise drawings and coordinating designs across multiple disciplines. He is particularly passionate about the early design stages, especially laying out systems and equipment, and enjoys seeing projects come to life during construction.\n+ Citi Plaza - City of London Relocation, Office\nFit-Up, London, Ontario // D\n+ Davis Martindale Tenant\n+ Grand Theatre - Public and Artist Space Modernization, London, Ontario // D\n+ Stoney Creek YMCA Expansion, Addition of 2nd Floor, Stoney Creek, Ontario\n+ Lambeth Community Health and Wellness Centre, London, Ontario // D\n+ Lancer Sport and Recreation Centre, Windsor, Ontario\n+ Oxygen Yoga Tenant Fit-Up, London, Ontario // D\nCOMMERCE\n+ GNOSH Restaurant Tenant Fit-Up, London, Ontario // D\n+ St. Clair College Block F Renovation, Windsor, Ontario // D\n+ Fanshawe College\nSouth Campus, London, Ontario// D\n+ Conestoga College International School, Kitchener, Ontario // D\n+ Fanshawe College Downtown Building B, London, Ontario // CT\n+ Tesseyman Orthodontist Tenant Fit-Up, London, Ontario // D\nHOSPITALITY\n+ The Clayfield Hotel, Niagara-on-the-Lake, Ontario // D\n+ 195 Dufferin Affordable Housing Renovation, London, Ontario // D\n+ Liner Apartment Buildings, Niagara-on-the-Lake, Ontario // D\n+ West 5 BB-2 Retirement Residence, London, Ontario\n// BT",
            "May Oo\nDesigner\nEDUCATION\nBachelor of Engineering (Mechatronic),Yangon Technological University (2008)\nSpecialist Diploma in M&E Coordination ,BCA academy, Singapore (2014)\nYEAR STARTED WITH S+A\n2023\nMay is a Mechanical Designer with a Bachelor of Engineering in Mechatronics and a Specialist Diploma in M&E Coordination. With expertise in BIM software, design\ncoordination, and a focus on design-builds and fast-track projects, May is known for being detail-oriented and adept at collaborating with teams to deliver innovative solutions.\nPassionate about learning and applying new technologies, May thrives in dynamic environments, working on both commercial and residential projects.\nRELEVANT EXPERIENCE\nYEAR STARTED IN THE INDUSTRY\n2008\nROLES PERFORMED\nSCT – Senior CAD Technician SBT – Senior BIM Technician CT – CAD Technician\nBT – Technician\nHEALTHCARE\n+ Medical Centre at Kampung Admiralty (HDB) , Green Mark (LEED) Platinum , Singapore// BT\nOFFICE\n+ The Robinson Tower , Office Building with retail podium & basement carpark, Singapore // SBT\n+ Metropolis , Office building,Complex integrated with retail and F&B outlets, Green Mark (LEED) Platinum\n,Singapore // SCT\n+ National Service Hub (NSH), Office & Amenities, Basement Carpark, Green Mark (LEED) Certified, Singapore // SBT\nRESIDENTIAL\n+ Ripple Bay, Residential (Condominium development), Green Mark (LEED) Certified , Singapore // SCT\n+ The Glades, Residential (Condominium development) , Singapore // BT\n+ University Town, Residential , Singapore // CT\nSPORTS + RECREATION\n+ University Studio ,\nTheme park & Recreation , Singapore // CT\nINDUSTRIAL\n+ Woodland North Coast, Industrial development with shop, restaurant & Office, basement carpark, Singapore // SBT",
            "Amber Hawley\nBIM Leader\nAmber is a skilled BIM Leader with experience in mechanical design and coordination across diverse projects, including multi-unit residential, casinos, and healthcare facilities. Holding an Advanced Diploma in Architectural Technology from Fanshawe College, she has a strong background in Revit, BIM software, and technical expertise in layout design, clash detection, and multi-disciplinary coordination. Amber is known for her attention to detail, problem-solving abilities, and her commitment to optimizing building systems to ensure seamless project execution. She thrives in collaborative environments, ensuring that complex designs are accurately modeled and efficiently executed from concept to completion.\nRELEVANT EXPERIENCE\nCIVIC\n+ Waterloo Regional Airport, ON // BT\n+ Wasaga Twin Pad and Library, ON // BT\nRESIDENTIAL\n+ Terrace Lodge Long-Term Care, London ON // BT\n+ Sifton West 5 Building A and Spektra, London ON // BT\nARTS, CULTURE + ENTERTAINMENT\n+ Wasaga Casino, Wasaga Beach, ON // BT\n+ Hanover Casino, Hanover, ON // BT\nEDUCATION\n+ University of Waterloo Health Innovation Arena, Waterloo ON // BT\n+ Fanshawe Innovation Village, London ON// BT",
            "CLIMATE CHANGE\nENVIRONMENTAL PRACTICES\nSmith + Andersen champions sustainable building design - it is part of our Mission, Vision and Values. We work closely with, Footprint, a member of the Smith + Andersen Group of Companies, looking for the most energy efficient solutions, not only for operational savings, but also because we want to help the planet. Smith + Andersen’s building designs generally exceed energy standards – often well in advance of those standards becoming a minimum code requirement. We have won several engineering awards including the coveted international ASHRAE society technical award in 2016 for Humber River Hospital because it is the most energy-efficient acute care hospital in North America. We also won a Consulting Engineering award for the engineering design of the University of Toronto Scarborough Campus Environmental Science and Chemistry Building, which is a LEED Gold certified laboratory building which is operating better than modeled. Company-wide Smith +\nAndersen and Footprint have 158 staff who are LEED accredited. We also have staff who are designated ASHRAE High-Performance Building Design Professionals (HBDP) and ASHRAE Healthcare Facility Design Professionals (HFDP).\nA philosophy of sustainability runs deep throughout the company, and Smith + Andersen makes every effort to encourage responsible, environmentally-friendly design. The full range of services we offer has made Smith + Andersen the company of choice for so many owners who place their trust in us to propose and implement innovative, energy efficient, sustainable solutions. These clients know that our unique skills and experience in maximizing energy efficiency allows us to match today’s design challenges with more holistic, sustainable solutions.\nSmith + Andersen feel that it is imperative for leaders within the engineering industry to also be leaders in innovative practices. The ability to stay current and constantly evolve our practices and services allows not only up-to-date with the latest trends within the industry, but it also allows us to offer the gold standard in services to our clients.\nSOCIAL GOVERNANCE\nOur people set Smith + Andersen apart, and have consistently been the driving force behind our growth as an organization. We confront new challenges and move into new specialty areas by understanding that what makes each of us different makes us a better company. The diversity of opinions and viewpoints within our company is what has shaped us as one of the most respected consulting engineering firms in Canada. But we need to push harder to make space for these voices within Smith + Andersen and within the architecture, engineering, and construction industry.\nWith this in mind, Smith + Andersen Leaders initiated the Diversity Working Group in 2020. This group is focused on establishing and upholding a clear vision and objectives surrounding diversity,\nequity, and inclusion that will have wide-reaching impact within Smith + Andersen and across our industry.\nCORPORATE GOVERNANCE\nBeyond our core values, which inform everything we do, Smith + Andersen is a multidisciplinary firm. Our growth has always stemmed from the unique perspectives that exist within our firm. Engineers work alongside lighting designers and intelligent integrated systems specialists, all learning from\none another to move the company, and our industry, forward. Our firm operates through a non- hierarchical work structure, offering the kind of access that encourages upward mobility and the elevation of unique and innovative ideas.\nHowever, like many companies in our industry, and the industry as a whole, we still have a long way to go. Below are just a few of the initiatives that encourage diversity and inclusion within our company – initiatives which are only growing in number:\n+  Financial Commitment: As part of our larger charity and donation strategy, the Smith\n+ Andersen Group has made a national commitment to focus charitable donations to organizations that promote diversity, equality, and inclusion within the architecture, engineering, and construction industry.\n+  Mentorship: Mentorship has always been central to Smith + Andersen’s operations, owing in part to the thriving co-op program which has become synonymous with our firm. In fact, as of the end of 2020, 13% of S+A staff and 20% of S+A leaders started with the firm as a\nco-op student – percentages which continue to grow. We pride ourselves on providing an environment where mentorship can take place regardless of job title.\n+\tInternal Committees and Working Groups: We support our staff and leaders on issues that are important to them – support which ensures that initiatives surrounding diversity and inclusion are genuine. Smith + Andersen’s Women in STEM Committee and our Diversity Working Group are two such internal committees dedicated to addressing diversity and inclusion within our company and across the industry as a whole. Smith + Andersen also stands in support of larger, industry-wide commitments, such as Engineers Canada’s 30 by\n30 Initiative – a program dedicated to increasing the national percentage of newly licensed engineers who identify as women to 30 per cent by the year 2030. Thirty per cent is universally held as the tipping point for sustainable change.\n+\tEmployee Opinion Survey: Smith + Andersen conducts a nation-wide Employee Opinion survey through a third-party provider every three to four years, consistently seeing record engagement. Our 2014 survey saw 80% engagement, our 2018 survey saw 90% engagement, and our most recent survey, held in May 2021, proudly saw record engagement yet again.\nWe consistently look to these survey results to tell us how our employees view our company, identifying where we need to improve across key categories closely linked to equity and\ninclusion, such as employee engagement, employee enablement, authority and empowerment, and development opportunities.\n+\tContinued Learning: Smith + Andersen actively promote continual learning. Our staff are constantly attending conferences, hosting industry leaders to speak about some of the more innovative features and practices within their disciplines. We do our best to stay ahead of the game by remaining current and abreast about the direction in which our industry is headed.",
            "VALUE ADDED\nOFFICE LOCATION\nSmith + Andersen’s Hamilton office is conveniently located just minutes from Hamilton’s City Hall, placing the team at the heart of the city’s civic and business activity. This central location allows for easy access to major municipal offices, development projects, and community stakeholders,\nhelping the firm maintain strong local connections and stay closely involved in the city’s growth and transformation.\nSmith + Andersen’s Hamilton office benefits from the close collaboration and ongoing support of the firm’s London and Toronto offices. This interconnected team approach allows the Hamilton office to draw on a broad network of expertise, specialized knowledge, and project resources across Southern Ontario. Whether it's sharing technical insight, coordinating on large-scale projects, or providing additional staffing support when needed, the London and Toronto teams work seamlessly with Hamilton to ensure consistent, high-quality service for clients throughout the region.\nLOCAL EXPERIENCE\nWith a longstanding presence in the region, Smith + Andersen has delivered years of mechanical and electrical engineering consulting services throughout the city of Hamilton and its surrounding communities. From institutional and healthcare facilities to commercial developments and residential complexes, the firm’s diverse project portfolio reflects a deep understanding of the area’s unique engineering needs. Their consistent involvement in local projects showcases a strong commitment to supporting Hamilton’s evolving infrastructure and sustainable development goals.\nADDITIONAL SERVICES\nIn addition to our mechanical and electrical engineering services, Smith + Andersen offer the following services:\n+\tSpecialty Lighting: Specialty lighting design, when applied creatively with the client’s needs in mind, is a powerful tool that can greatly enhance any space. Smith + Andersen’s award- winning lighting professionals see their mission as a simple one: build on the environments created by architects and interior designers while respecting energy management and operational, maintenance, and budget considerations. Our design team’s portfolio features\na wide range of Canadian and international projects that include commercial spaces, retail, healthcare, long-term care facilities, restaurants, hotels, residential, sports and recreational, exterior, entertainment/broadcasting, and educational facilities..\n+\tTelecommunications: Whether it is for commercial, retail, healthcare—or almost any other\nkind of project—Smith + Andersen’s in-house telecommunications team can help clients navigate the sometimes overwhelming world of technology. Only after thoroughly assessing our clients’ needs will we begin creating customized systems designs that provide costeffective, integrated and truly innovative solutions from day one and right through the lifespan of the facility. Our in-depth knowledge of audio-visual, security, closed-circuit television (CCTV), Community Antenna Television (CATV), and hospital monitoring and wireless systems allows us to converge these technologies into a unified, intelligentbuilding network.\n+\tSecurity: In today’s world, security and surveillance are increasingly critical to a modern facility’s occupant protection and asset management capabilities. Smith + Andersen takes the security and safety of both tenants and owners very seriously, and our clients can feel assured knowing that our design team brings years of extensive experience and knowledge to each and every project we undertake. Our security and surveillance specialists are involved in each step of the planning process for each new facility or upgrade, including the integration of all components to form a complete and efficient security system.\n+\tAudiovisual: Smith + Andersen’s audio-visual services can design highquality audio-visual, performance sound, collaborative technology and digital signage systems for just about\nany setting or application. From hospitality, performing arts, and entertainment venues to corporate, government, and education facilities, our engineered solutions support both the owner’s needs and the architect’s vision for the facility, addressing both budget and schedule requirements. We also offer a full complement of related specialized services, including needs analyses, budgets, design narratives, bidder recommendations, tender process guidance, and system commissioning.\n+\tBuilding Automation Systems: Energy Management and Controls Systems integrate and optimize many of a building’s most crucial systems: heating, ventilation and air- conditioning (HVAC), lighting, access controls and fire and smoke management. Smith +\nAndersen’s controls specialists, with an extensive knowledge of mechanical, electrical and communications systems, provides clients with high-quality energy management and controls systems, and much more: assessment of existing pneumatic, electric and electronic controls systems; in-depth knowledge of BACnet and LonWorks and experience with controls systems designed “open” or to manufacturer’s specifications for energy efficiency and optimization.\n+\tItelligent Systems: The Smith + Andersen Intelligent Integrated Systems (IIS) group focuses on improving operational and energy efficiencies through common telecommunications infrastructure. Existing buildings typically have multiple stand-alone systems, where technologies such as building automation, lighting control, access control, and video surveillance are often not connected. This convergence of systems must be managed through an overall plan, and that’s where the Smith + Andersen IIS team provides the greatest value. Our team applies design expertise which helps clients navigate the variety of integration approaches that are currently on the market—empowering clients to be fiscally responsible, efficient, and to, ultimately, get the most out of their building."
        ],
        "token_lengths": [
            188,
            505,
            570,
            542,
            347,
            525,
            545,
            687,
            731,
            607,
            285,
            700,
            611,
            407,
            261,
            1174,
            1004
        ],
        "largest": {
            "tokens": 1174,
            "text": "CLIMATE CHANGE\nENVIRONMENTAL PRACTICES\nSmith + Andersen champions sustainable building design - it is part of our Mission, Vision and Values. We work closely with, Footprint, a member of the Smith + Andersen Group of Companies, looking for the most energy efficient solutions, not only for operational savings, but also because we want to help the planet. Smith + Andersen’s building designs generally exceed energy standards – often well in advance of those standards becoming a minimum code requirement. We have won several engineering awards including the coveted international ASHRAE society technical award in 2016 for Humber River Hospital because it is the most energy-efficient acute care hospital in North America. We also won a Consulting Engineering award for the engineering design of the University of Toronto Scarborough Campus Environmental Science and Chemistry Building, which is a LEED Gold certified laboratory building which is operating better than modeled. Company-wide Smith +\nAndersen and Footprint have 158 staff who are LEED accredited. We also have staff who are designated ASHRAE High-Performance Building Design Professionals (HBDP) and ASHRAE Healthcare Facility Design Professionals (HFDP).\nA philosophy of sustainability runs deep throughout the company, and Smith + Andersen makes every effort to encourage responsible, environmentally-friendly design. The full range of services we offer has made Smith + Andersen the company of choice for so many owners who place their trust in us to propose and implement innovative, energy efficient, sustainable solutions. These clients know that our unique skills and experience in maximizing energy efficiency allows us to match today’s design challenges with more holistic, sustainable solutions.\nSmith + Andersen feel that it is imperative for leaders within the engineering industry to also be leaders in innovative practices. The ability to stay current and constantly evolve our practices and services allows not only up-to-date with the latest trends within the industry, but it also allows us to offer the gold standard in services to our clients.\nSOCIAL GOVERNANCE\nOur people set Smith + Andersen apart, and have consistently been the driving force behind our growth as an organization. We confront new challenges and move into new specialty areas by understanding that what makes each of us different makes us a better company. The diversity of opinions and viewpoints within our company is what has shaped us as one of the most respected consulting engineering firms in Canada. But we need to push harder to make space for these voices within Smith + Andersen and within the architecture, engineering, and construction industry.\nWith this in mind, Smith + Andersen Leaders initiated the Diversity Working Group in 2020. This group is focused on establishing and upholding a clear vision and objectives surrounding diversity,\nequity, and inclusion that will have wide-reaching impact within Smith + Andersen and across our industry.\nCORPORATE GOVERNANCE\nBeyond our core values, which inform everything we do, Smith + Andersen is a multidisciplinary firm. Our growth has always stemmed from the unique perspectives that exist within our firm. Engineers work alongside lighting designers and intelligent integrated systems specialists, all learning from\none another to move the company, and our industry, forward. Our firm operates through a non- hierarchical work structure, offering the kind of access that encourages upward mobility and the elevation of unique and innovative ideas.\nHowever, like many companies in our industry, and the industry as a whole, we still have a long way to go. Below are just a few of the initiatives that encourage diversity and inclusion within our company – initiatives which are only growing in number:\n+  Financial Commitment: As part of our larger charity and donation strategy, the Smith\n+ Andersen Group has made a national commitment to focus charitable donations to organizations that promote diversity, equality, and inclusion within the architecture, engineering, and construction industry.\n+  Mentorship: Mentorship has always been central to Smith + Andersen’s operations, owing in part to the thriving co-op program which has become synonymous with our firm. In fact, as of the end of 2020, 13% of S+A staff and 20% of S+A leaders started with the firm as a\nco-op student – percentages which continue to grow. We pride ourselves on providing an environment where mentorship can take place regardless of job title.\n+\tInternal Committees and Working Groups: We support our staff and leaders on issues that are important to them – support which ensures that initiatives surrounding diversity and inclusion are genuine. Smith + Andersen’s Women in STEM Committee and our Diversity Working Group are two such internal committees dedicated to addressing diversity and inclusion within our company and across the industry as a whole. Smith + Andersen also stands in support of larger, industry-wide commitments, such as Engineers Canada’s 30 by\n30 Initiative – a program dedicated to increasing the national percentage of newly licensed engineers who identify as women to 30 per cent by the year 2030. Thirty per cent is universally held as the tipping point for sustainable change.\n+\tEmployee Opinion Survey: Smith + Andersen conducts a nation-wide Employee Opinion survey through a third-party provider every three to four years, consistently seeing record engagement. Our 2014 survey saw 80% engagement, our 2018 survey saw 90% engagement, and our most recent survey, held in May 2021, proudly saw record engagement yet again.\nWe consistently look to these survey results to tell us how our employees view our company, identifying where we need to improve across key categories closely linked to equity and\ninclusion, such as employee engagement, employee enablement, authority and empowerment, and development opportunities.\n+\tContinued Learning: Smith + Andersen actively promote continual learning. Our staff are constantly attending conferences, hosting industry leaders to speak about some of the more innovative features and practices within their disciplines. We do our best to stay ahead of the game by remaining current and abreast about the direction in which our industry is headed."
        }
    }
]